library IEEE;
use IEEE.STD_LOGIC_1164.ALL;
use ieee.std_logic_unsigned.all;
use ieee.std_logic_arith.all;

entity Servos is port(
	SX : out std_logic_vector (1 downto 0);
	SY : out std_logic_vector (1 downto 0);
	s1 : out std_logic;
	s2 : out std_logic;
	clock : in std_logic;
	VRX : in std_logic_vector(9 downto 0);
	VRY : in std_logic_vector(9 downto 0));
end Servos;

architecture Behavioral of Servos is 
	signal clk,clktope,relogio,uhr,T,mov0,mov1,mov2: std_logic := '1';
	signal cont,cont1,cont0 : integer := 1;
	signal sñ0,sñ1,sñ2,sñ3,sñ4,sñ5,sñ6,sñ7,sñ8,sñ9,sñ10 : std_logic := '1';
	signal sñ11,sñ12,sñ13,sñ14,sñ15,sñ16,sñ17,sñ18,sñ19 : std_logic := '1';
	signal señal : std_logic_vector (5 downto 0) := "000001";
	signal doscientos: std_logic_vector (7 downto 0) := "00000001";
	signal señalt : std_logic_vector (4 downto 0) := "00001";
begin
clk <= clock;

--------------------Main Process-----------------------
	process (VRY, VRX, mov0, mov1, mov2, relogio) begin
	---Parte Servomotor con 360° de libertad
		if VRY < "0100101100" then
			SY <= "01";
			s1 <= mov1;
		elsif VRY > "1110000100" then--1001011000
			SY <= "10";
			s1 <= mov2;
		else
			SY <= "11";
			s1 <= mov0;
		end if;
	---Parte Servomotor con 180° de libertad
		if relogio'event and relogio = '1' then
			if VRX < "0100101100" then
				SX <= "01";
				if señalt = "00000" then
					señalt <= "00000";
				else
					señalt <= señalt - "00001";
				end if;
			elsif VRX > "1110000100" then
				SX <= "10";
				if señalt = "10011" then
					señalt <= "10011";
				else
					señalt <= señalt + "00001";
				end if;
			else 
				SX <= "11";
				señalt <= señalt;
			end if;
		end if;
	end process;
--Divisor de Frecuencia para selector--
	Process(clk)begin
		if clk'event and clk = '1' then
			if cont0 = 1500000 then --1000000 = 25Hz
				cont0 <= 1;
				relogio <= not relogio;
			else
				cont0 <= cont0 + 1;
			end if;
		end if;
	end process;
----Divisor de Frecuencia cont servo libre----
	Process (clk) begin
		if clk'event and clk = '1' then
			if cont = 12500 then --12500 = 2kHz
				cont <= 1;
				uhr <= not uhr;
			else
				cont <= cont + 1;
			end if;
		end if;
	end process;
---Divisor de Frecuencia cont servo con tope---
	process (clk) begin
		if clk'event and clk = '1' then
			if cont1 = 2500 then
				cont1 <= 1;
				T <= not T;
			else
				cont1 <= cont1 + 1;
			end if;
		end if;
	end process;
-----Señales para servo sin tope-----
	process (uhr, señal) begin
		if uhr'event and uhr = '1' then
			señal <= señal + "000001";
		else 
			señal <= señal;---------------------------------------------------
		end if;
		case señal is
			when "000000" =>
				mov0 <= '1';
				mov1 <= '1';
				mov2 <= '1';
			when "000001" =>
				mov0 <= '1';
				mov1 <= '1';
				mov2 <= '1';
			when "000010" =>
				mov0 <= '1';
				mov1 <= '0';
				mov2 <= '1';
			when "000011" =>
				mov0 <= '0';
				mov1 <= '0';
				mov2 <= '1';
			when "000100" =>
				mov0 <= '0';
				mov1 <= '0';
				mov2 <= '0';
			when others => 
				mov0 <= '0';
				mov1 <= '0';
				mov2 <= '0';
		end case;
	end process;
-----Señales para servo con tope-----
	process (señalt,sñ0,sñ1,sñ2,sñ3,sñ4,sñ5,sñ6,sñ7,sñ8,sñ9,
				sñ10,sñ11,sñ12,sñ13,sñ14,sñ15,sñ16,sñ17,sñ18,sñ19) begin
		case señalt is --señalt es de 4 bits
			when "00000" => s2 <= sñ0;
			when "00001" => s2 <= sñ1;
			when "00010" => s2 <= sñ2;
			when "00011" => s2 <= sñ3;
			when "00100" => s2 <= sñ4;
			when "00101" => s2 <= sñ5;
			when "00110" => s2 <= sñ6;
			when "00111" => s2 <= sñ7;
			when "01000" => s2 <= sñ8;
			when "01001" => s2 <= sñ9;
			when "01010" => s2 <= sñ10;
			when "01011" => s2 <= sñ11;
			when "01100" => s2 <= sñ12;
			when "01101" => s2 <= sñ13;
			when "01110" => s2 <= sñ14;
			when "01111" => s2 <= sñ15;
			when "10000" => s2 <= sñ16;
			when "10001" => s2 <= sñ17;
			when "10010" => s2 <= sñ18;
			when "10011" => s2 <= sñ19;
			when others => s2 <= sñ8;
		end case;
	end process;
	process (T,doscientos) begin
		if T'event and T = '1' then
			doscientos <= doscientos + "00000001";
		end if;
		case doscientos is
			when "00000000" => --1
				sñ0 <= '1';
				sñ1 <= '1';
				sñ2 <= '1';
				sñ3 <= '1';
				sñ4 <= '1';
				sñ5 <= '1';
				sñ6 <= '1';
				sñ7 <= '1';
				sñ8 <= '1';
				sñ9 <= '1';
				sñ10 <= '1';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00000001" => --2
				sñ0 <= '1';
				sñ1 <= '1';
				sñ2 <= '1';
				sñ3 <= '1';
				sñ4 <= '1';
				sñ5 <= '1';
				sñ6 <= '1';
				sñ7 <= '1';
				sñ8 <= '1';
				sñ9 <= '1';
				sñ10 <= '1';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00000010" => --3
				sñ0 <= '1';
				sñ1 <= '1';
				sñ2 <= '1';
				sñ3 <= '1';
				sñ4 <= '1';
				sñ5 <= '1';
				sñ6 <= '1';
				sñ7 <= '1';
				sñ8 <= '1';
				sñ9 <= '1';
				sñ10 <= '1';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00000011" => --4
				sñ0 <= '1';
				sñ1 <= '1';
				sñ2 <= '1';
				sñ3 <= '1';
				sñ4 <= '1';
				sñ5 <= '1';
				sñ6 <= '1';
				sñ7 <= '1';
				sñ8 <= '1';
				sñ9 <= '1';
				sñ10 <= '1';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
		---------------------------
			when "00000100" => --5
				sñ0 <= '0';
				sñ1 <= '1';
				sñ2 <= '1';
				sñ3 <= '1';
				sñ4 <= '1';
				sñ5 <= '1';
				sñ6 <= '1';
				sñ7 <= '1';
				sñ8 <= '1';
				sñ9 <= '1';
				sñ10 <= '1';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00000101" => --6
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '1';
				sñ3 <= '1';
				sñ4 <= '1';
				sñ5 <= '1';
				sñ6 <= '1';
				sñ7 <= '1';
				sñ8 <= '1';
				sñ9 <= '1';
				sñ10 <= '1';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00000110" => --7
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '1';
				sñ4 <= '1';
				sñ5 <= '1';
				sñ6 <= '1';
				sñ7 <= '1';
				sñ8 <= '1';
				sñ9 <= '1';
				sñ10 <= '1';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00000111" => --8
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '1';
				sñ5 <= '1';
				sñ6 <= '1';
				sñ7 <= '1';
				sñ8 <= '1';
				sñ9 <= '1';
				sñ10 <= '1';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00001000" => --9
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '0';
				sñ5 <= '1';
				sñ6 <= '1';
				sñ7 <= '1';
				sñ8 <= '1';
				sñ9 <= '1';
				sñ10 <= '1';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00001001" => --10
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '0';
				sñ5 <= '0';
				sñ6 <= '1';
				sñ7 <= '1';
				sñ8 <= '1';
				sñ9 <= '1';
				sñ10 <= '1';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00001010" => --11
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '0';
				sñ5 <= '0';
				sñ6 <= '0';
				sñ7 <= '1';
				sñ8 <= '1';
				sñ9 <= '1';
				sñ10 <= '1';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00001011" => --12
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '0';
				sñ5 <= '0';
				sñ6 <= '0';
				sñ7 <= '0';
				sñ8 <= '1';
				sñ9 <= '1';
				sñ10 <= '1';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00001100" => --13
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '0';
				sñ5 <= '0';
				sñ6 <= '0';
				sñ7 <= '0';
				sñ8 <= '0';
				sñ9 <= '1';
				sñ10 <= '1';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00001101" => --14
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '0';
				sñ5 <= '0';
				sñ6 <= '0';
				sñ7 <= '0';
				sñ8 <= '0';
				sñ9 <= '0';
				sñ10 <= '1';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00001110" => --15
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '0';
				sñ5 <= '0';
				sñ6 <= '0';
				sñ7 <= '0';
				sñ8 <= '0';
				sñ9 <= '0';
				sñ10 <= '0';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00001111" => --16
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '0';
				sñ5 <= '0';
				sñ6 <= '0';
				sñ7 <= '0';
				sñ8 <= '0';
				sñ9 <= '0';
				sñ10 <= '0';
				sñ11 <= '0';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00010000" => --17
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '0';
				sñ5 <= '0';
				sñ6 <= '0';
				sñ7 <= '0';
				sñ8 <= '0';
				sñ9 <= '0';
				sñ10 <= '0';
				sñ11 <= '0';
				sñ12 <= '0';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00010001" => --18
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '0';
				sñ5 <= '0';
				sñ6 <= '0';
				sñ7 <= '0';
				sñ8 <= '0';
				sñ9 <= '0';
				sñ10 <= '0';
				sñ11 <= '0';
				sñ12 <= '0';
				sñ13 <= '0';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00010010" => --19
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '0';
				sñ5 <= '0';
				sñ6 <= '0';
				sñ7 <= '0';
				sñ8 <= '0';
				sñ9 <= '0';
				sñ10 <= '0';
				sñ11 <= '0';
				sñ12 <= '0';
				sñ13 <= '0';
				sñ14 <= '0';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00010011" => --20
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '0';
				sñ5 <= '0';
				sñ6 <= '0';
				sñ7 <= '0';
				sñ8 <= '0';
				sñ9 <= '0';
				sñ10 <= '0';
				sñ11 <= '0';
				sñ12 <= '0';
				sñ13 <= '0';
				sñ14 <= '0';
				sñ15 <= '0';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00010100" => --21
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '0';
				sñ5 <= '0';
				sñ6 <= '0';
				sñ7 <= '0';
				sñ8 <= '0';
				sñ9 <= '0';
				sñ10 <= '0';
				sñ11 <= '0';
				sñ12 <= '0';
				sñ13 <= '0';
				sñ14 <= '0';
				sñ15 <= '0';
				sñ16 <= '0';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00010101" => --22
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '0';
				sñ5 <= '0';
				sñ6 <= '0';
				sñ7 <= '0';
				sñ8 <= '0';
				sñ9 <= '0';
				sñ10 <= '0';
				sñ11 <= '0';
				sñ12 <= '0';
				sñ13 <= '0';
				sñ14 <= '0';
				sñ15 <= '0';
				sñ16 <= '0';
				sñ17 <= '0';
				sñ18 <= '1';
				sñ19 <= '1';
			when "00010110" => --23
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0'; 
				sñ4 <= '0';
				sñ5 <= '0';
				sñ6 <= '0';
				sñ7 <= '0';
				sñ8 <= '0';
				sñ9 <= '0';
				sñ10 <= '0';
				sñ11 <= '0';
				sñ12 <= '0';
				sñ13 <= '0';
				sñ14 <= '0';
				sñ15 <= '0';
				sñ16 <= '0';
				sñ17 <= '0';
				sñ18 <= '0';
				sñ19 <= '1';
			when "11111111" => 
				sñ0 <= '1';
				sñ1 <= '1';
				sñ2 <= '1';
				sñ3 <= '1';
				sñ4 <= '1';
				sñ5 <= '1';
				sñ6 <= '1';
				sñ7 <= '1';
				sñ8 <= '1';
				sñ9 <= '1';
				sñ10 <= '1';
				sñ11 <= '1';
				sñ12 <= '1';
				sñ13 <= '1';
				sñ14 <= '1';
				sñ15 <= '1';
				sñ16 <= '1';
				sñ17 <= '1';
				sñ18 <= '1';
				sñ19 <= '1';
			when others =>
				sñ0 <= '0';
				sñ1 <= '0';
				sñ2 <= '0';
				sñ3 <= '0';
				sñ4 <= '0';
				sñ5 <= '0';
				sñ6 <= '0';
				sñ7 <= '0';
				sñ8 <= '0';
				sñ9 <= '0';
				sñ10 <= '0';
				sñ11 <= '0';
				sñ12 <= '0';
				sñ13 <= '0';
				sñ14 <= '0';
				sñ15 <= '0';
				sñ16 <= '0';
				sñ17 <= '0';
				sñ18 <= '0';
				sñ19 <= '0';
		end case;
	end process;
end Behavioral;

